nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB3/KW47B42ZB3_cm33_core1.xml
        <register>
          <name>BLE_REG_TMR_SWT_VALUE_2</name>
          <description>Software Timer 2: Expiration Value</description>
          <addressOffset>0x824</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>expiry_value</name>
              <description>Expiry Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TMR_SWT_STS_2</name>
          <description>Software Timer 2: Expiration Status</description>
          <addressOffset>0x828</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>expiry_status</name>
              <description>Expiry Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>SWT expired at programmed value without any errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>SWT was programmed for a value that is in the past</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>skip_status</name>
              <description>Clock skipping Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>SWT expired at programmed value without any skipping error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Current timer expiry is due to clock skipping over the programmed expiration value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TMR_SWT_CTL_3</name>
          <description>Software Timer 3: Control</description>
          <addressOffset>0x830</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>timer_en</name>
              <description>Set Timer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>disable timer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>enable timer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>expiry_emask_tx</name>
              <description>Event Mask: Tx</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>no event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Tx event triggered at timer expiry</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>expiry_emask_rx</name>
              <description>Event Mask: Rx</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>no event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Rx event triggered at timer expiry</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>expiry_emask_intr</name>
              <description>Event Mask: Interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>no event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>interrupt triggered at expiry of timer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>expiry_emask_abort</name>
              <description>Event Mask: Abort</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>no event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Tx/Rx abort triggered at expiry of timer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>slot_mask</name>
              <description>Slot Mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>frame</name>
                  <description>timer works on frame basis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>invalid</name>
                  <description>invalid</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>slot</name>
                  <description>timer works on slot basis</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>halfslot</name>
                  <description>timer works on half slot basis</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TMR_SWT_VALUE_3</name>
          <description>Software Timer 3: Expiration Value</description>
          <addressOffset>0x834</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>expiry_value</name>
              <description>Expiry Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TMR_SWT_STS_3</name>
          <description>Software Timer 3: Expiration Status</description>
          <addressOffset>0x838</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>expiry_status</name>
              <description>Expiry Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>SWT expired at programmed value without any errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>SWT was programmed for a value that is in the past</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>skip_status</name>
              <description>Clock skipping Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>SWT expired at programmed value without any skipping error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Current timer expiry is due to clock skipping over the programmed expiration value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TMR_NATIVE_QUS</name>
          <description>Native quarter microsecond counter Value</description>
          <addressOffset>0x83C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xC2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>nat_clock_sleep</name>
              <description>Native quarter microsecond counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TMR_NATIVE_CLOCK</name>
          <description>Native mcClock Value</description>
          <addressOffset>0x840</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>nat_clock_sleep</name>
              <description>Native Clock Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TMR_WAKEUP_DELAY_LPO_CYCLES</name>
          <description>Wakeup delay value in LPO cycles</description>
          <addressOffset>0x844</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>wakeup_delay_lpo_cycles</name>
              <description>Wakeup delay in LPO cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TMR_CLOCK_SKIP</name>
          <description>Native Clock Value</description>
          <addressOffset>0x848</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>old_native_clock</name>
              <description>Native Clock Value (before skip)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
