nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB3/KW47B42ZB3_cm33_core1.xml
        <register>
          <name>BTU_PTA_SYNC_CTRL</name>
          <description>PTA Voice/WLAN Sync Control</description>
          <addressOffset>0xF36</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>sync_priority_fw_val</name>
              <description>Sync Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sync_dir_fw_val</name>
              <description>Sync Direction</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>Rx first</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>Tx first</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>sync_mode_en</name>
              <description>Sync Mode Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sync_fs_en</name>
              <description>Sync Frame Scheduler Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sync_frame_fw_en</name>
              <description>Sync Frame Firmware Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sync_frame_fw_val</name>
              <description>Sync Frame Firmware Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sync_sco_en</name>
              <description>Sync SCO Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sync_esco_inst_en</name>
              <description>Sync eSCO Instant Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sync_esco_retr_en</name>
              <description>Sync eSCO Retry Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sync_esco_active_en</name>
              <description>Sync eSCO Active Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sync_active_fw_val</name>
              <description>Sync Frame Active Firmware Value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sync_active_fw_en</name>
              <description>Sync Frame Active Firmware Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sync_priority_fw_en</name>
              <description>Sync Frame Priority Firmware Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sync_dir_fw_en</name>
              <description>Sync Frame Direction Firmware Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_BLE_TX_PWR_THRHD</name>
          <description>BLE Tx Power Threshold to Suppress Tx Overlap Assertion</description>
          <addressOffset>0xF38</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble1M_tx_pwr_thrshld</name>
              <description>BLE Tx power threshold for 1 Mbps packet to suppress BT_Overlap/BT_Scan_Overlap assertion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble2M_tx_pwr_thrshld</name>
              <description>BLE Tx power threshold for 2 Mbps packet to suppress BT_Overlap/BT_Scan_Overlap assertion</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_STATE_DELAY_TIMER</name>
          <description>PTA Bt_State Delay Timer</description>
          <addressOffset>0xF42</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>pta_state_delay</name>
              <description>PTA State Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_SLNA_CTRL</name>
          <description>PTA SLNA Control</description>
          <addressOffset>0xF44</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_use_slna</name>
              <description>BLE uses SLNA based on RSSI info</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>use path 3 for Bluetooth only based on BLE RSSI average</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable SLNA path based on BLE RSSI average</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ble_slna_cp_en_bp_sel</name>
              <description>BLE side enable SLNA bias/charge pump bypass for software control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>use hardware dynamically controlled SLNA_cp_en</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>software bypass to control the SLNA_cp_en</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ble_slna_cp_en_bp_val</name>
              <description>SLNA_cp Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>eisable SLNA cp</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable SLNA cp</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>btc_use_slna</name>
              <description>BTC uses SLNA based on RSSI info</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>use path 3 for Bluetooth only based on BTC RSSI average</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable SLNA path based on BTC RSSI average</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>btc_slna_cp_en_bp_sel</name>
              <description>BTC side enable SLNA bias/charge pump bypass for software control</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>use hardware dynamically controlled SLNA_cp_en</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>software bypass to control the SLNA_cp_en</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>btc_slna_cp_en_bp_val</name>
              <description>SLNA_cp Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>eisable SLNA cp</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable SLNA cp</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_TX_POWER_THRESHOLD</name>
          <description>Tx Power Threshold to Suppress Tx Overlap Assertion</description>
          <addressOffset>0xF46</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bdr_tx_pwr_thrshld</name>
              <description>Tx power threshold for BDR packet to suppress bt_overlap/bt_scan_overlap assertion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>edr_tx_pwr_thrshld</name>
              <description>Tx power threshold for EDR packet to suppress bt_overlap/bt_scan_overlap assertion</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_TX_OVERLAP_RANGE</name>
          <description>MWS Frequency Overlap Range for Bluetooth Tx Slot</description>
          <addressOffset>0xF48</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>tx_mws_overlap_range</name>
              <description>MWS frequency overlap range for BR/EDR Tx Slots</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_tx_mws_overlap_range</name>
              <description>MWS frequency overlap range for BLE Tx packets</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_RX_OVERLAP_RANGE</name>
          <description>MWS Frequency Overlap Range for Bluetooth Rx Slot</description>
          <addressOffset>0xF4A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rx_mws_overlap_range</name>
              <description>MWS frequency overlap range for BR/EDR Rx Slots</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_mws_overlap_range</name>
              <description>MWS frequency overlap range for BLE Rx Packets</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_COEX_BT_TX_ON_START</name>
          <description>MWS Coex Signal BT_TX_ON Start Timer</description>
          <addressOffset>0xF4C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btTxOnStartReg</name>
              <description>BT_TX_ON Start Timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_COEX_BT_TX_ON_END</name>
          <description>MWS Coex Signal BT_TX_ON End Timer</description>
          <addressOffset>0xF4E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btTxOnEndReg</name>
              <description>BT_TX_ON End Timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST</name>
          <description>MWS Coex Signal BT_RX_PRI Start Timer for Master Mode</description>
          <addressOffset>0xF50</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btRxPriStartMstReg</name>
              <description>BT_RX_PRI Start Timer for Master Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_COEX_BT_RX_PRI_END</name>
          <description>MWS Coex Signal BT_RX_PRI End Timer</description>
          <addressOffset>0xF52</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btRxPriEndReg</name>
              <description>BT_RX_PRI End Timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_FRAMESYNC_REFCLK_0</name>
          <description>Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt</description>
          <addressOffset>0xF54</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwsFrameSync_refClk</name>
              <description>Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_FRAMESYNC_REFCLK_1</name>
          <description>Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt</description>
          <addressOffset>0xF56</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwsFrameSync_refClk</name>
              <description>Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_FRAMESYNC_REFPDB_CNT</name>
          <description>Bluetooth Reference pdBitCounter Snapshot on MWS Frame Sync Pulse Interrupt</description>
          <addressOffset>0xF58</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwsFrameSync_pdBitCnt</name>
              <description>Bluetooth Reference pdBitCounter Snapshot on MWS Frame Sync Pulse Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_PATTERN_REFCLK_0</name>
          <description>Bluetooth Reference Clock Snapshot on MWS_Pattern_Real_Int Interrupt</description>
          <addressOffset>0xF5A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwsPattern_refClk</name>
              <description>Bluetooth Reference Clock Snapshot on MWS_PATTERN Pulse Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_PATTERN_REFCLK_1</name>
          <description>Bluetooth Reference Clock Snapshot on MWS_Pattern_Real_Int Interrupt</description>
          <addressOffset>0xF5C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwsPattern_refClk</name>
              <description>Bluetooth Reference Clock Snapshot on MWS_PATTERN Pulse Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_PATTERN_REFPDB_CNT</name>
          <description>Bluetooth Reference pdBitCounter Snapshot on MWS_Pattern_Real_Int Interrupt</description>
          <addressOffset>0xF5E</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwsPattern_pdBitCnt</name>
              <description>Bluetooth Reference pdBitCounter Snapshot on MWS_PATTERN Pulse Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_PATTERN_VAL</name>
          <description>MWS Coex Signal MWS_PATTERN Value</description>
          <addressOffset>0xF60</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwsPatternReg</name>
              <description>MWS Coex Signal MWS_PATTERN Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>mwsScanFreqReg</name>
              <description>MWS Coex Signal MWS_SCAN_FREQUENCY Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_3DG_CLK_UPDATE_REFCLK_0</name>
          <description>Bluetooth Reference Clock Snapshot on BT_3DG_CLK_UPATE Pulse Interrupt</description>
          <addressOffset>0xF62</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BT3dgClkUpdate_refClk</name>
              <description>Bluetooth Reference Clock Snapshot on 3D-Glass Clock Update Pulse Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
