nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB3/KW47B42ZB3_cm33_core1.xml
        <register>
          <name>AGC_IDX11_GAIN_CFG</name>
          <description>AGC IDX11 Gain Config</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7E07</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBPF_GAIN_11</name>
              <description>CBPF_GAIN_11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_GAIN_11_0</name>
                  <description>-6 dB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_GAIN_11_1</name>
                  <description>0 dB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNA_RTRIM_11</name>
              <description>LNA_RTRIM_11</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_ATTN_11</name>
              <description>LNA_ATTN_11</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HATTN_11</name>
              <description>LNA_HATTN_11</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_LGAIN_11</name>
              <description>LNA_LGAIN_11</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HGAIN_11</name>
              <description>LNA_HGAIN_11</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_EN_RLOAD_11</name>
              <description>ANT_EN_RLOAD_11</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_11_DRS_OFS</name>
              <description>Mag Thresh DRS for AGC Gain Index 11</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_11_DRS_OFS</name>
              <description>Mag Thresh High DRS for AGC Gain Index 11</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX10_GAIN_CFG</name>
          <description>AGC IDX10 Gain Config</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2E07</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBPF_GAIN_10</name>
              <description>CBPF_GAIN_10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_GAIN_10_0</name>
                  <description>-6 dB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_GAIN_10_1</name>
                  <description>0 dB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNA_RTRIM_10</name>
              <description>LNA_RTRIM_10</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_ATTN_10</name>
              <description>LNA_ATTN_10</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HATTN_10</name>
              <description>LNA_HATTN_10</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_LGAIN_10</name>
              <description>LNA_LGAIN_10</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HGAIN_10</name>
              <description>LNA_HGAIN_10</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_EN_RLOAD_10</name>
              <description>ANT_EN_RLOAD_10</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_10_DRS_OFS</name>
              <description>Magnitude threshold high offset for AGC gain index 10 when datarate_config_sel = 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_10_DRS_OFS</name>
              <description>Magnitude threshold offset for AGC gain index 10 when datarate_config_sel = 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX9_GAIN_CFG</name>
          <description>AGC IDX9 Gain Config</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1207</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBPF_GAIN_9</name>
              <description>CBPF_GAIN_9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_GAIN_9_0</name>
                  <description>-6 dB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_GAIN_9_1</name>
                  <description>0 dB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNA_RTRIM_9</name>
              <description>LNA_RTRIM_9</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_ATTN_9</name>
              <description>LNA_ATTN_9</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HATTN_9</name>
              <description>LNA_HATTN_9</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_LGAIN_9</name>
              <description>LNA_LGAIN_9</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HGAIN_9</name>
              <description>LNA_HGAIN_9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_EN_RLOAD_9</name>
              <description>ANT_EN_RLOAD_9</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_9_DRS_OFS</name>
              <description>Magnitude threshold high offset for AGC gain index 9 when datarate_config_sel = 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_9_DRS_OFS</name>
              <description>Magnitude threshold offset for AGC gain index 9 when datarate_config_sel = 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX8_GAIN_CFG</name>
          <description>AGC IDX8 Gain Config</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x607</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBPF_GAIN_8</name>
              <description>CBPF_GAIN_8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_GAIN_8_0</name>
                  <description>-6 dB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_GAIN_8_1</name>
                  <description>0 dB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNA_RTRIM_8</name>
              <description>LNA_RTRIM_8</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_ATTN_8</name>
              <description>LNA_ATTN_8</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HATTN_8</name>
              <description>LNA_HATTN_8</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_LGAIN_8</name>
              <description>LNA_LGAIN_8</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HGAIN_8</name>
              <description>LNA_HGAIN_8</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_EN_RLOAD_8</name>
              <description>ANT_EN_RLOAD_8</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_8_DRS_OFS</name>
              <description>Magnitude threshold high offset for AGC gain index 8 when datarate_config_sel = 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_8_DRS_OFS</name>
              <description>Magnitude threshold offset for AGC gain index 8 when datarate_config_sel = 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX7_GAIN_CFG</name>
          <description>AGC IDX7 Gain Config</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x207</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBPF_GAIN_7</name>
              <description>CBPF_GAIN_7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_GAIN_7_0</name>
                  <description>-6 dB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_GAIN_7_1</name>
                  <description>0 dB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNA_RTRIM_7</name>
              <description>LNA_RTRIM_7</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_ATTN_7</name>
              <description>LNA_ATTN_7</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HATTN_7</name>
              <description>LNA_HATTN_7</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_LGAIN_7</name>
              <description>LNA_LGAIN_7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HGAIN_7</name>
              <description>LNA_HGAIN_7</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_EN_RLOAD_7</name>
              <description>ANT_EN_RLOAD_7</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_7_DRS_OFS</name>
              <description>Magnitude threshold high offset for AGC gain index 7 when datarate_config_sel = 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_7_DRS_OFS</name>
              <description>Magnitude threshold offset for AGC gain index 7 when datarate_config_sel = 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX6_GAIN_CFG</name>
          <description>AGC IDX6 Gain Config</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x187</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBPF_GAIN_6</name>
              <description>CBPF_GAIN_6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_GAIN_6_0</name>
                  <description>-6 dB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_GAIN_6_1</name>
                  <description>0 dB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNA_RTRIM_6</name>
              <description>LNA_RTRIM_6</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_ATTN_6</name>
              <description>LNA_ATTN_6</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HATTN_6</name>
              <description>LNA_HATTN_6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_LGAIN_6</name>
              <description>LNA_LGAIN_6</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HGAIN_6</name>
              <description>LNA_HGAIN_6</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_EN_RLOAD_6</name>
              <description>ANT_EN_RLOAD_6</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_6_DRS_OFS</name>
              <description>Magnitude threshold high offset for AGC gain index 6 when datarate_config_sel = 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_6_DRS_OFS</name>
              <description>Magnitude threshold offset for AGC gain index 6 when datarate_config_sel = 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX5_GAIN_CFG</name>
          <description>AGC IDX5 Gain Config</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x107</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBPF_GAIN_5</name>
              <description>CBPF_GAIN_5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_GAIN_5_0</name>
                  <description>-6 dB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_GAIN_5_1</name>
                  <description>0 dB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNA_RTRIM_5</name>
              <description>LNA_RTRIM_5</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_ATTN_5</name>
              <description>LNA_ATTN_5</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HATTN_5</name>
              <description>LNA_HATTN_5</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_LGAIN_5</name>
              <description>LNA_LGAIN_5</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HGAIN_5</name>
              <description>LNA_HGAIN_5</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_EN_RLOAD_5</name>
              <description>ANT_EN_RLOAD_5</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_5_DRS_OFS</name>
              <description>Magnitude threshold high offset for AGC gain index 5 when datarate_config_sel = 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_5_DRS_OFS</name>
              <description>Magnitude threshold offset for AGC gain index 5 when datarate_config_sel = 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
