nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB3/KW47B42ZB3_cm33_core1.xml
        <register>
          <name>SWITCH_TX_CTRL</name>
          <description>SWITCH_TX_CTRL</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWITCH_MOD</name>
              <description>SWITCH_MOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWITCH_FIR_SEL</name>
              <description>SWITCH_FIR_SEL</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWITCH_GFSK_COEFF</name>
              <description>SWITCH_GFSK_COEFF</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWITCH_TGT_PWR_CLAMPED</name>
              <description>SWITCH_TGT_PWR_CLAMPED</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWITCH_TGT_PWR_CLAMPED_0</name>
                  <description>SWITCH_TGT_PWR value is power target value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWITCH_TGT_PWR_CLAMPED_1</name>
                  <description>If non-switch power target is less than SWITCH_TGT_PWR value then power target is kept the same, on the contrary power target is clamped at SWITCH_TGT_PWR value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWITCH_TGT_PWR</name>
              <description>SWITCH_TGT_PWR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_DFT_TX_CTRL0</name>
          <description>RF_DFT_TX_CTRL0</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DFT_MAX_RAM_SIZE</name>
              <description>DFT_MAX_RAM_SIZE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFT_RAM_BASE_ADDR</name>
              <description>DFT_RAM_BASE_ADDR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFT_RAM_EN</name>
              <description>DFT_RAM_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_DFT_TX_CTRL1</name>
          <description>RF_DFT_TX_CTRL1</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2101FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LFSR_OUT</name>
              <description>LFSR_OUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LFSR_CLK_SEL</name>
              <description>LFSR_CLK_SEL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LFSR_LENGTH</name>
              <description>LFSR_LENGTH</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRM</name>
              <description>LRM</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LFSR_EN</name>
              <description>LFSR_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_DFT_TX_CTRL2</name>
          <description>RF_DFT_TX_CTRL2</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DFT_PA_AM_MOD_FREQ</name>
              <description>DFT_PA_AM_MOD_FREQ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFT_PA_AM_MOD_ENTRIES</name>
              <description>DFT_PA_AM_MOD_ENTRIES</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFT_PA_AM_MOD_EN</name>
              <description>DFT_PA_AM_MOD_EN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFT_PATTERN_EN</name>
              <description>DFT_PATTERN_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_DFT_PATTERN</name>
          <description>RF_DFT_PATTERN</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DFT_MOD_PATTERN</name>
              <description>DFT_MOD_PATTERN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATARATE_CONFIG_FSK_CTRL</name>
          <description>DATARATE_CONFIG_FSK_CTRL</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATARATE_CONFIG_FSK_FDEV0</name>
              <description>DATARATE_CONFIG_DATA_PAD_MFDEV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATARATE_CONFIG_FSK_FDEV1</name>
              <description>DATARATE_CONFIG_DATA_PAD_PFDEV</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATARATE_CONFIG_GFSK_CTRL</name>
          <description>DATARATE_CONFIG_GFSK_CTRL</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATARATE_CONFIG_GFSK_FDEV</name>
              <description>DATARATE_CONFIG_GFSK_FDEV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATARATE_CONFIG_FILTER_CTRL</name>
          <description>DATARATE_CONFIG_FILTER_CTRL</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATARATE_CONFIG_IMAGE_FILTER_OVRD_EN</name>
              <description>DATARATE_CONFIG_IMAGE_FILTER_OVRD_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATARATE_CONFIG_FIR_FILTER_OVRD</name>
              <description>DATARATE_CONFIG_FIR_FILTER_OVRD</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATARATE_CONFIG_SYNC0_FILTER_OVRD</name>
              <description>DATARATE_CONFIG_SYNC0_FILTER_OVRD</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATARATE_CONFIG_SYNC1_FILTER_OVRD</name>
              <description>DATARATE_CONFIG_SYNC1_FILTER_OVRD</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATARATE_CONFIG_GFSK_FILT_CLK_SEL</name>
              <description>DATARATE_CONFIG_GFSK_FILT_CLK_SEL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATARATE_CONFIG_SYNC0_CLK_SEL</name>
              <description>DATARATE_CONFIG_IMAGE_SYNC0_CLK_SEL</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATARATE_CONFIG_SYNC1_CLK_SEL</name>
              <description>DATARATE_CONFIG_IMAGE_SYNC1_CLK_SEL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATARATE_CONFIG_IMAGE_FIR_CLK_SEL</name>
              <description>DATARATE_CONFIG_IMAGE_FIR_CLK_SEL</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
