nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB3/KW47B42ZB3_cm33_core1.xml
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>LR_PD_PH%s</name>
          <description>PHY Long Range Preamble Detect Phase i</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF0</name>
              <description>Long range preamble reference waveform sample 0 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF1</name>
              <description>Long range preamble reference waveform sample 1 (sfix6en5)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF2</name>
              <description>Long range preamble reference waveform sample 2 (sfix6en5)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF3</name>
              <description>Long range preamble reference waveform sample 3 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>13</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>4,5,6,7,8,9,10,11,12,13,14,15,16</dimIndex>
          <name>LR_PD_RO_PH%s</name>
          <description>PHY Long Range Preamble Detect Read Only Phase i</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF0</name>
              <description>Long range preamble reference waveform sample 16 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REF1</name>
              <description>Long range preamble reference waveform sample 17 (sfix6en5)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REF2</name>
              <description>Long range preamble reference waveform sample 18 (sfix6en5)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REF3</name>
              <description>Long range preamble reference waveform sample 19 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LR_AA_CFG</name>
          <description>PHY Long Range AA Config</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AA_COR_THRESH</name>
              <description>Threshold use to compare the correlation magnitude in the long-range AA correlator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AA_HAM_THRESH</name>
              <description>Threshold use to compare the Hamming distance, between reference coded sequence and received coded sequence, in the long-range AA correlator.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACCESS_ADDR_HAM</name>
              <description>Threshold use to compare the Hamming distance, between the reference AA sequence and the received Viterbi decoded AA sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AA_LR_CORR_GAIN</name>
              <description>AA correlator gain. Format ufix6en3. This gain is applied to soft bits from the demodulator before they are used for address search synchronization.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LR_STAT</name>
          <description>PHY Long Range Status</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DECODED_HAMM_DIST</name>
              <description>Hamming distance between the reference sequence and the Viterbi decoded received sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AA_FOUND</name>
              <description>Indicates that a AA detect is active for both LR and uncoded.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CI</name>
              <description>CI received.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CODED_HAMM_DIST</name>
              <description>Hamming distance between the coded reference sequence and the coded received sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AA_CORR_MAX</name>
              <description>Indicates the AA correlation magnitude witnessed when AA match occurred</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMAG_MAX</name>
              <description>Indicates the maximum preamble correlation magnitude during preamble found</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM_CFG</name>
          <description>PHY State Machine Config</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACQ_MODE</name>
              <description>Acquisition mode for non-coded reception</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A1</name>
                  <description>Use preamble and verify a correlation peak, the synch at the symbol rate as symbol timing is established by the preamble acquisition</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2</name>
                  <description>Use synch only (which may incorporate part of the preamble)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A3</name>
                  <description>Use mainly the sync detection: Use a low threshold on the preamble detector and launch the synch detection only if the preamble has shown a recent peak</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN_PHY_SM_EXT_RST</name>
              <description>Enable PHY state-machine reset on the external reset port; Reserved, should keep 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>Reset is not allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>Reset is allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGC_FRZ_ON_PD_FOUND_ACQ1_LR</name>
              <description>Specifies AGC freeze condition for non-coded acq.1 and Bluetooth LE long range.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A1</name>
                  <description>AGC freeze on AA found.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A0</name>
                  <description>AGC freeze asserted on PD found.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PH_BUFF_PTR_SYM</name>
              <description>Phase buffer size to demodulator, long range only.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EARLY_PD_TIMEOUT</name>
              <description>Time-out used to reset the AGC state-machine for the eventuality that an &quot;PD found early&quot; , expressed in number of sample clock cycles. Event occurs but it is not followed by an &quot;PD found&quot; event</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AA_TIMEOUT_UNCODED</name>
              <description>Time-out value for access address search for uncoded packets, expressed in number of sample clock cycles</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <description>PHY Misc Config</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSSI_CORR_TH</name>
              <description>Threshold use to compare a correlation magnitude value, computed in the acquisition block, in order to determine the correlation flag value provided by the PHY to the LQI computation block. Format is ufix8_En8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_PAGE_SEL</name>
              <description>Select which DMA page is send out</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>Select DMA PAGE 0 for M3C with cfo;</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>Select DMA PAGE 1 for M3C with magnitude;</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2</name>
                  <description>Select DMA PAGE 2 for un-coded;</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A3</name>
                  <description>Select DMA PAGE 3 for Long Range Preamble Detect;</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A4</name>
                  <description>Select DMA PAGE 4 for Long Range AA Detect;</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECO1_RSVD</name>
              <description>Reserved . Must be programed as reset value 0.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_CLK_CTRL</name>
              <description>Enables various clock gating features. Bits are individually decoded, so any combination is allowable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECO2_RSVD</name>
              <description>Reserved</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTEST_MUX_EN</name>
              <description>Reserved . Should be programed as reset value 0.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_CLK_ON</name>
              <description>Force PHY clock ON</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT0</name>
          <description>PHY Status 0</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD_FOUND</name>
              <description>PD_FOUND for LR or uncoded</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LR_DET_FLAG</name>
              <description>Indicates Bluetooth LE long range was detected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AA_MATCHED</name>
              <description>Indicates AA was matched for LR or uncoded</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AA_FOUND_ID</name>
              <description>Indicates which AA was matched for LR and uncode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>uncoded address 0 matched</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>uncoded address 1 matched</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2</name>
                  <description>uncoded address 2 matched</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A3</name>
                  <description>uncoded address 3 matched</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A4</name>
                  <description>long range address matched</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_RATE</name>
              <description>Indicates the data rate of received bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>1Mbps</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>2Mbps</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2</name>
                  <description>125kbps</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A3</name>
                  <description>500kbps</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRAC</name>
              <description>Indicates the fractional timing estimate determined in the acquisition block. Format is sfix6_en5(sign extend from sfix3_En2).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFO_EST</name>
              <description>Indicates the currently estimated CFO. Format is sfix10_en9(sign extend from sfix8_en9)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT1</name>
          <description>PHY Status 1</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AA_BITS</name>
              <description>AA bits either received or programed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT2</name>
          <description>PHY Status 2</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT_ANT_SW</name>
              <description>Count of uncoded ANT switch event when FAD was enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_UNCAA_TIMEOUT</name>
              <description>Count of uncoded AA search timeout event</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_LRAA_TIMEOUT</name>
              <description>Count of long range AA search timeout event</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_AACI_TIMEOUT</name>
              <description>Count of long range AACI detect timeout event</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_AGC_RST</name>
              <description>Count of AGC soft reset event</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PREPHY_MISC</name>
          <description>PHY PrePHY Misc Config</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUFF_PTR_LR</name>
              <description>Pointer to the PrePHY IQ buffer for the reception of the long-range packets.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFF_PTR_GFSK</name>
              <description>Pointer to the PrePHY IQ buffer for the reception of the uncoded packets.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
