nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB3/KW47B42ZB3_cm33_core1.xml
        <register>
          <name>OVRD4</name>
          <description>TSM OVERRIDE REGISTER 4</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_PIC_CORE_EN_OVRD_EN</name>
              <description>Override control for SEQ_PIC_CORE_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_PIC_CORE_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_PIC_CORE_EN_OVRD_EN_1</name>
                  <description>Use the state of SEQ_PIC_CORE_EN_OVRD to override the signal &quot;seq_pic_core_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_PIC_CORE_EN_OVRD</name>
              <description>Override value for SEQ_PIC_CORE_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD_EN</name>
              <description>Override control for SEQ_PIC_SHORT_CINT_SHORT_EN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD_EN_1</name>
                  <description>Use the state of SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD to override the signal &quot;seq_pic_short_cint_short_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD</name>
              <description>Override value for SEQ_PIC_SHORT_CINT_SHORT_EN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD_EN</name>
              <description>Override control for SEQ_PIC_FILTER_LOW_BW_SM_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD_EN_1</name>
                  <description>Use the state of SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD to override the signal &quot;seq_pic_filter_low_bw_sm_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD</name>
              <description>Override value for SEQ_PIC_FILTER_LOW_BW_SM_EN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_RFB_OPEN_SM_EN_OVRD_EN</name>
              <description>Override control for SEQ_PIC_RFB_OPEN_SM_EN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_PIC_RFB_OPEN_SM_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_PIC_RFB_OPEN_SM_EN_OVRD_EN_1</name>
                  <description>Use the state of SEQ_PIC_RFB_OPEN_SM_EN_OVRD to override the signal &quot;seq_pic_rfb_open_sm_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_PIC_RFB_OPEN_SM_EN_OVRD</name>
              <description>Override value for SEQ_PIC_RFB_OPEN_SM_EN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_RINT2_SHORT_FM_EN_OVRD_EN</name>
              <description>Override control for SEQ_PIC_RINT2_SHORT_FM_EN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_PIC_RINT2_SHORT_FM_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_PIC_RINT2_SHORT_FM_EN_OVRD_EN_1</name>
                  <description>Use the state of SEQ_PIC_RINT2_SHORT_FM_EN_OVRD to override the signal &quot;seq_pic_rint2_short_fm_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_PIC_RINT2_SHORT_FM_EN_OVRD</name>
              <description>Override value for SEQ_PIC_RINT2_SHORT_FM_EN</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LODIV_SYNC_RESET_EN_OVRD_EN</name>
              <description>Override control for SEQ_LODIV_SYNC_RESET_EN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LODIV_SYNC_RESET_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LODIV_SYNC_RESET_EN_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LODIV_SYNC_RESET_EN_OVRD to override the signal &quot;seq_lodiv_sync_reset_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LODIV_SYNC_RESET_EN_OVRD</name>
              <description>Override value for SEQ_LODIV_SYNC_RESET_EN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LODIV_SYNC_EN_OVRD_EN</name>
              <description>Override control for SEQ_LODIV_SYNC_EN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LODIV_SYNC_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LODIV_SYNC_EN_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LODIV_SYNC_EN_OVRD to override the signal &quot;seq_lodiv_sync_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LODIV_SYNC_EN_OVRD</name>
              <description>Override value for SEQ_LODIV_SYNC_EN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LODIV_SYNC_SPARE_EN_OVRD_EN</name>
              <description>Override control for SEQ_LODIV_SYNC_SPARE_EN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LODIV_SYNC_SPARE_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LODIV_SYNC_SPARE_EN_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LODIV_SYNC_SPARE_EN_OVRD to override the signal &quot;seq_lodiv_sync_spare_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LODIV_SYNC_SPARE_EN_OVRD</name>
              <description>Override value for SEQ_LODIV_SYNC_SPARE_EN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2</name>
          <description>TSM CONTROL 2</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>RST_CSR_SW_EN</name>
              <description>Reset CSR Timing Values By SW 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RST_CSR_SW_EN_0</name>
                  <description>Reset Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RST_CSR_SW_EN_1</name>
                  <description>Reset Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST_CSR_SW2_EN</name>
              <description>Reset CSR Timing Values By SW 2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RST_CSR_SW2_EN_0</name>
                  <description>Reset Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RST_CSR_SW2_EN_1</name>
                  <description>Reset Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
