nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB3/KW47B42ZB3_cm33_core1.xml
        <register>
          <name>LDO_TRIM_RES_1</name>
          <description>RF Analog LDO Trim Res Control 1</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LDO_CAL_TRIM</name>
              <description>LDO_CAL_TRIM Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LDO_TRIM_CMPOUT</name>
              <description>LDO TRIM CMPOUT</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCL_CFG0</name>
          <description>LCL CTRL CFG 0</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LCL_EN</name>
              <description>Localization Control Module Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_LCL_EN</name>
              <description>Enable Switching in TX</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_LCL_EN</name>
              <description>Enable Switching in RX</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LANT_INV</name>
              <description>Invert Antenna Switch Output</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_EN</name>
              <description>Pattern Matching Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_TX_EN</name>
              <description>Pattern Matching Enable in TX</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_TRIG</name>
              <description>Software Trigger. Can be used with either RX or TX</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LANT_SW_WIGGLE</name>
              <description>LANT_SW Wiggle</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PM_NUM_BYTES</name>
              <description>Number of Bytes to Match</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PM_NUM_BYTES_0</name>
                  <description>4 bytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PM_NUM_BYTES_1</name>
                  <description>5 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PM_NUM_BYTES_2</name>
                  <description>6 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PM_NUM_BYTES_3</name>
                  <description>8 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LANT_BLOCK_TX</name>
              <description>Block LANT_SW for TX</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LANT_BLOCK_RX</name>
              <description>Block LANT_SW for RX</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTE_DUR</name>
              <description>Total Switching Duration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AP_MAX</name>
              <description>Max number of Antenna paths</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_SYNC</name>
              <description>Reserved</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_SIGNED</name>
              <description>Delay signed feature</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCL_ANT_PERMUT_EN</name>
              <description>Enable antenna permutation for mode 2 and 3</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCL_ADJ_ENDMASK</name>
              <description>This field manages the tone_extension in LCL bloc, must be set to 1 in localization context</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCL_GPIO_SEL</name>
              <description>Localization GPIO Select</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCL_MODE</name>
              <description>Localization Mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCL_MODE_0</name>
                  <description>GenLL configuration.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCL_MODE_1</name>
                  <description>Bluetooth LE LL configuration.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LCL_CFG1</name>
          <description>LCL CTRL CFG 1</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M_ON_DELAY</name>
              <description>M on Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>N_ON_DELAY</name>
              <description>N on Delay</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_SW_MODE3</name>
              <description>Antenna switch for mode 3 PM to DT transition</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_SW_RF</name>
              <description>Antenna switch trigger mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LANT_SW_IE</name>
              <description>Localization Antenna Switch Interrupt Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LANT_SW_IE_0</name>
                  <description>Localization Antenna Switch interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LANT_SW_IE_1</name>
                  <description>Localization Antenna Switch interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LANT_SW_FLAG</name>
              <description>Localization Antenna Switch Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LCL_TX_CFG0</name>
          <description>LCL CTRL TX CONFIG0</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_DELAY</name>
              <description>Interval delay before TX switching begins.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_DELAY_OFF</name>
              <description>Fine sample delay after TX_DELAY.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_SW_FRAC_OFFSET_DN</name>
              <description>TX_SW_FRAC_OFFSET_DN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_SW_FRAC_OFFSET_UP</name>
              <description>TX_SW_FRAC_OFFSET_UP</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCL_TX_CFG1</name>
          <description>LCL CTRL TX CONFIG1</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_SPINT</name>
              <description>Number of TX Samples that define the length of an Interval, where 0=1sample, 1=2sample, etc.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_LO_PER</name>
              <description>Primary Number of intervals for antenna LOW</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_HI_PER</name>
              <description>Primary Number of intervals for antenna HIGH</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_ANT_TRIG_SEL</name>
              <description>Selects Trigger for TX</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TX_ANT_TRIG_SEL_0</name>
                  <description>Software Trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_ANT_TRIG_SEL_1</name>
                  <description>LCL Pattern Found</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_ANT_TRIG_SEL_2</name>
                  <description>CRC Complete</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_ANT_TRIG_SEL_3</name>
                  <description>PA Warm-up complete</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_ANT_TRIG_SEL_4</name>
                  <description>RBME Tx Done</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_ANT_TRIG_SEL_5</name>
                  <description>cte_en from NBU</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_ANT_TRIG_SEL_6</name>
                  <description>Ranging sequence manager lcl_tx_trigger</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_SW_ACTIVE</name>
              <description>TX_SW_ACTIVE</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_SW_OFFSET</name>
              <description>TX_SW_OFFSET</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_SW_ADD_OFFSET_UP</name>
              <description>TX_SW_ADD_OFFSET_UP</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSM_CTRL6</name>
          <description>RSM CTRL 6</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2C25</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSM_RXLAT_DIG</name>
              <description>Digital Latency</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_SKIP_RECYCLE_R2R</name>
              <description>RECYCLE R2R</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_PKTRAM_EXTEND</name>
              <description>Packet Ram Extend Information</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_EARLY_MOD_DIS</name>
              <description>Early Mod Disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_MODE0_TIMEOUT</name>
              <description>RSM TIMEOUT IN MODE0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCL_RX_CFG0</name>
          <description>LCL CTRL RX CONFIG0</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_DELAY</name>
              <description>Interval delay before RX switching begins.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_DELAY_OFF</name>
              <description>Fine sample delay after RX_DELAY.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCL_RX_CFG1</name>
          <description>LCL CTRL RX CONFIG1</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_SPINT</name>
              <description>Number of RX Samples that define the length of an Interval, where 0=1sample, 1=2sample, etc.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_LO_PER</name>
              <description>Primary Number of intervals for antenna LOW</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_HI_PER</name>
              <description>Primary Number of intervals for antenna HIGH</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_ANT_TRIG_SEL</name>
              <description>Selects Trigger for RX</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_ANT_TRIG_SEL_0</name>
                  <description>Software Trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ANT_TRIG_SEL_1</name>
                  <description>LCL Pattern Found</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ANT_TRIG_SEL_2</name>
                  <description>CRC Complete</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ANT_TRIG_SEL_3</name>
                  <description>CRC Pass</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ANT_TRIG_SEL_4</name>
                  <description>GenericLL: cte_present, Bluetooth LE: cte_en</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ANT_TRIG_SEL_5</name>
                  <description>aa_fnd_to_ll</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ANT_TRIG_SEL_6</name>
                  <description>Ranging sequence manager lcl_rx_trigger</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LCL_RX_CFG2</name>
          <description>LCL CTRL RX CONFIG2</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LCL_PM_MSB</name>
          <description>LCL CTRL PM MSB</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COMP_PATTERN_MSB</name>
              <description>Upper bytes of pattern to be matched, bits 63:32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCL_PM_LSB</name>
          <description>LCL CTRL PM LSB</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COMP_PATTERN_LSB</name>
              <description>Lower bytes of pattern to be matched, bits 31:0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
