nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB3/KW47B42ZB3_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SMSCM</name>
      <description>Secure Miscellaneous System Control Module</description>
      <groupName>SMSCM</groupName>
      <baseAddress>0xA9195000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xC04</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DBGEN</name>
          <description>Debug Enable</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBGEN</name>
              <description>Invasive Debug Enable (DFF3 bitfield)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>r000</name>
                  <description>Invasive Debug Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>w2s</name>
                  <description>W2S - Enable Invasive Debug.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>w5c</name>
                  <description>W5C - Disable Invasive Debug.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIDEN</name>
              <description>Secure Invasive Debug Enable (DFF3 bitfield)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>r000</name>
                  <description>Secure Invasive Debug Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>w2s</name>
                  <description>W2S - Enable Secure Invasive Debug.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>w5c</name>
                  <description>W5C - Disable Secure Invasive Debug.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NIDEN</name>
              <description>Non-Invasive Debug Enable (DFF3 bitfield)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>r000</name>
                  <description>Non-Invasive Debug Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>w2s</name>
                  <description>W2S - Enable Non-Invasive Debug.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>w5c</name>
                  <description>W5C - Disable Non-Invasive Debug.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPNIDEN</name>
              <description>Secure Non-Invasive Debug Enable (DFF3 bitfield)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>r000</name>
                  <description>Secure Non-Invasive Debug Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>w2s</name>
                  <description>W2S - Enable Secure Non-Invasive Debug.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>w5c</name>
                  <description>W5C - Disable Secure Non-Invasive Debug.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALTDBGEN</name>
              <description>Alternate Invasive Debug Enable (DFF3 bitfield)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>r000</name>
                  <description>Alternate Invasive Debug Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>w2s</name>
                  <description>W2S - Enable Alternate Invasive Debug.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>w5c</name>
                  <description>W5C - Disable Alternate Invasive Debug.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALTEN</name>
              <description>Alternate Enable (DFF3 bitfield)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>r000</name>
                  <description>Alternate Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>w2s</name>
                  <description>W2S - Enable Alternate.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>w5c</name>
                  <description>W5C - Disable Alternate.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGEN_B</name>
          <description>Debug Enable Complement</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x222222</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBGEN_B</name>
              <description>Invasive Debug Enable Complement (DFF3 bitfield)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>r000</name>
                  <description>Invasive Debug Enabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>w2s</name>
                  <description>W2S - Disable Invasive Debug.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>w5c</name>
                  <description>W5C - Enable Invasive Debug.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIDEN_B</name>
              <description>Secure Invasive Debug Enable - Complement (DFF3 bitfield)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>r000</name>
                  <description>Secure Invasive Debug Enabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>w2s</name>
                  <description>W2S - Disable Secure Invasive Debug.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>w5c</name>
                  <description>W5C - Enable Secure Invasive Debug.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NIDEN_B</name>
              <description>Non-Invasive Debug Enable Complement (DFF3 bitfield)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>r000</name>
                  <description>Non-Invasive Debug Enabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>w2s</name>
                  <description>W2S - Disable Non-Invasive Debug.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>w5c</name>
                  <description>W5C - Enable Non-Invasive Debug.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPNIDEN_B</name>
              <description>Secure Non-Invasive Debug Enable Complement (DFF3 bitfield)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>r000</name>
                  <description>Secure Non-Invasive Debug Enabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>w2s</name>
                  <description>W2S - Disable Secure Non-Invasive Debug.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>w5c</name>
                  <description>W5C - Enable Secure Non-Invasive Debug.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALTDBGEN_B</name>
              <description>Alternate Invasive Debug Enable Complement (DFF3 bitfield)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>r000</name>
                  <description>Alternate Invasive Debug Enabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>w2s</name>
                  <description>W2S - Alternate Disable Invasive Debug.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>w5c</name>
                  <description>W5C - Alternate Enable Invasive Debug.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALTEN_B</name>
              <description>Alternate Enable Complement (DFF3 bitfield)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>r000</name>
                  <description>Alternrate Enabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>w2s</name>
                  <description>W2S - Disable Alternate.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>w5c</name>
                  <description>W5C - Enable Alternate.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGEN_LOCK</name>
          <description>Debug Enable Lock</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock (DFF3 bitfield)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>wlock_0</name>
                  <description>Lock DBGEN[SPNIDEN,NIDEN,SPIDEN,DBGEN], DBGEN_B[SPNIDEN_B,NIDEN_B,SPIDEN_B,DBGEN_B], and DBGEN_LOCK[LOCK].</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_1</name>
                  <description>Lock DBGEN[SPNIDEN,NIDEN,SPIDEN,DBGEN], DBGEN_B[SPNIDEN_B,NIDEN_B,SPIDEN_B,DBGEN_B], and DBGEN_LOCK[LOCK].</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_2</name>
                  <description>Lock DBGEN[SPNIDEN,NIDEN,SPIDEN,DBGEN], DBGEN_B[SPNIDEN_B,NIDEN_B,SPIDEN_B,DBGEN_B], and DBGEN_LOCK[LOCK].</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_3</name>
                  <description>Lock DBGEN[SPNIDEN,NIDEN,SPIDEN,DBGEN], DBGEN_B[SPNIDEN_B,NIDEN_B,SPIDEN_B,DBGEN_B], and DBGEN_LOCK[LOCK].</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_4</name>
                  <description>Lock DBGEN[SPNIDEN,NIDEN,SPIDEN,DBGEN], DBGEN_B[SPNIDEN_B,NIDEN_B,SPIDEN_B,DBGEN_B], and DBGEN_LOCK[LOCK].</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>w5c</name>
                  <description>When DBGEN_LOCK[LOCK] is locked, DBGEN_LOCK[LOCK] cannot be unlocked with a write of 101b to this field. When DBGEN_LOCK[LOCK] is unlocked, a write of 101b to this field, DBGEN_LOCK[LOCK] remains unlocked and the DBGEN[DBGEN, SPIDEN, NIDEN, SPNIDEN],DBGEN_B[DBGEN_B, SPIDEN_B, NIDEN_B, SPNIDEN_B] fields remain writeable.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_7</name>
                  <description>Lock DBGEN[SPNIDEN,NIDEN,SPIDEN,DBGEN], DBGEN_B[SPNIDEN_B,NIDEN_B,SPIDEN_B,DBGEN_B], and DBGEN_LOCK[LOCK].</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALT_DBGEN_LOCK</name>
              <description>Alternate Lock (DFF3 bitfield)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>wlock_0</name>
                  <description>Lock DBGEN[ALTDBGEN], DBGEN_B[ALTDBGEN_B, and DBGEN_LOCK[ALT_DBGEN_LOCK].</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_1</name>
                  <description>Lock DBGEN[ALTDBGEN], DBGEN_B[ALTDBGEN_B, and DBGEN_LOCK[ALT_DBGEN_LOCK].</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_2</name>
                  <description>Lock DBGEN[ALTDBGEN], DBGEN_B[ALTDBGEN_B, and DBGEN_LOCK[ALT_DBGEN_LOCK].</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_3</name>
                  <description>Lock DBGEN[ALTDBGEN], DBGEN_B[ALTDBGEN_B, and DBGEN_LOCK[ALT_DBGEN_LOCK].</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_4</name>
                  <description>Lock DBGEN[ALTDBGEN], DBGEN_B[ALTDBGEN_B, and DBGEN_LOCK[ALT_DBGEN_LOCK].</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>w5c</name>
                  <description>When ALT_DBGEN_LOCK is locked, ALT_DBGEN_LOCK cannot be unlocked with a write of 101b to this field. When ALT_DBGEN_LOCK is unlocked, a write of 101b to this field, ALT_DBGEN_LOCK remains unlocked and DBGEN/DBGEN_B remains writeable.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_7</name>
                  <description>Lock DBGEN[ALTDBGEN], DBGEN_B[ALTDBGEN_B, and DBGEN_LOCK[ALT_DBGEN_LOCK].</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALT_EN_LOCK</name>
              <description>Alternate Lock (DFF3 bitfield)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>wlock_0</name>
                  <description>Lock DBGEN[ALTEN], DBGEN_B[ALTEN_B, and DBGEN_LOCK[ALT_EN_LOCK].</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_1</name>
                  <description>Lock DBGEN[ALTEN], DBGEN_B[ALTEN_B, and DBGEN_LOCK[ALT_EN_LOCK].</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_2</name>
                  <description>Lock DBGEN[ALTEN], DBGEN_B[ALTEN_B, and DBGEN_LOCK[ALT_EN_LOCK].</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_3</name>
                  <description>Lock DBGEN[ALTEN], DBGEN_B[ALTEN_B, and DBGEN_LOCK[ALT_EN_LOCK].</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_4</name>
                  <description>Lock DBGEN[ALTEN], DBGEN_B[ALTEN_B, and DBGEN_LOCK[ALT_EN_LOCK].</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>w5c</name>
                  <description>f When ALT_EN_LOCK is locked, ALT_EN_LOCK cannot be unlocked with a write of 101b to this field. When ALT_EN_LOCK is unlocked, a write of 101b to this field, ALT_EN_LOCK remains unlocked and ALTEN/ALTEN_B remains writeable.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_7</name>
                  <description>Lock DBGEN[ALTEN], DBGEN_B[ALTEN_B, and DBGEN_LOCK[ALT_EN_LOCK].</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_AUTH_BEACON</name>
          <description>Debug Authentication Beacon</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>AUTH_BEACON</name>
              <description>Authentication Beacon</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CREDENTIAL_BEACON</name>
              <description>Credential Beacon</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
